'''
Урок 7. Завдання 3
Створіть програму, яка має 2 списки цілочисельних значень та
друкує список унікальних значень без повтору, які є в 1 списку (немає в другому) і навпаки.
'''

print('Введіть два списка цілих чисел ч-з пробіл')
int_num1 = [int(num) for num in input('  введіть список 1: ').split()]
int_num2 = [int(num) for num in input('  введіть список 2: ').split()]

set1, set2 = set(int_num1), set(int_num2)

print(f'список унікальних значень з 1 списку яких немає в другому {set1 - set2}')
print(f'         навпаки значення з 2 списку яких немає в першому {set2 - set1}')
print(f'Симетрична різниця - список унікальних значень з обох списків з виключенням перетину:\n {set1 ^ set2}')
